In [1]:
import psycopg2
import pandas as pd

# Variáveis de conexão com Elephant SQL
DATABASE = "nhjwuyyg"
USER = "nhjwuyyg"
PASSWORD = "pFPx0H-MMEGG60OS3YaPn_pM2KYIalOH"
HOST = "kesavan.db.elephantsql.com"
PORT = "5432" 

# String de conexão
conn_string = f"dbname='{DATABASE}' user='{USER}' password='{PASSWORD}' host='{HOST}' port='{PORT}'"

# Conectando ao banco de dados
try:
    conn = psycopg2.connect(conn_string)
    print("Conexão estabelecida!")
except Exception as e:
    print(f"Não foi possível conectar ao banco de dados: {e}")

cur = conn.cursor()

Conexão estabelecida!

### Query 1a
- **INSERT INTO EMPREGADO VALUES (...)**: Insere um novo empregado na tabela `EMPREGADO` com os valores especificados para cada coluna.

In [ ]:
query_1a = """
INSERT INTO EMPREGADO VALUES ('943775543', 'Roberto', 'F', 'Silva', 'M', 'Rua X, 22 – Araucária – PR', '1952-06-21', '888665555', '1', 58000);
"""
cur = conn.cursor()
cur.execute(query_1a)
conn.commit()

### Query 1f
- **DELETE FROM trabalha WHERE essn = '333445555'**: Remove da tabela `trabalha` todos os registros onde o número de segurança social é '333445555'.

In [ ]:
query_1f = """
DELETE FROM trabalha WHERE essn = '333445555';
"""
cur.execute(query_1f)
conn.commit()

### Query 1i
- **UPDATE departamento SET gerssn = '123456789', gerdatainicio = '1999-01-10' WHERE dnumero = '5'**: Atualiza o gerente e a data de início do gerente para o departamento número 5.

In [ ]:
query_1i = """
UPDATE departamento SET gerssn = '123456789', gerdatainicio = '1999-01-10' WHERE dnumero = '5';
"""
cur.execute(query_1i)
conn.commit()

### Query 1j
- **UPDATE empregado SET superssn = '943775543' WHERE ssn = '999887777'**: Atualiza o supervisor do empregado com ssn '999887777' para '943775543'.

In [ ]:
query_1i = """
UPDATE departamento SET gerssn = '123456789', gerdatainicio = '1999-01-10' WHERE dnumero = '5';
"""
cur.execute(query_1i)
conn.commit()

### Query 2a
- **SELECT e.ssn, d.nomedep, d.parentesco**: Seleciona o número de segurança social do empregado, nome do dependente e o parentesco.
- **FROM EMPREGADO e JOIN DEPENDENTE d ON d.essn = e.ssn**: Realiza um `JOIN` entre as tabelas `EMPREGADO` e `DEPENDENTE` onde o essn do dependente corresponde ao ssn do empregado.
- **ORDER BY e.ssn ASC, d.parentesco DESC**: Ordena os resultados pelo ssn de forma ascendente e pelo parentesco de forma descendente.

In [2]:
query_2a = """
SELECT e.ssn, d.nomedep, d.parentesco FROM EMPREGADO e JOIN DEPENDENTE d ON d.essn = e.ssn ORDER BY e.ssn ASC, d.parentesco DESC;
"""
df_2a = pd.read_sql(query_2a, conn)
df_2a

C:\Users\Ruy\AppData\Local\Temp\ipykernel_4520\422394707.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_2a = pd.read_sql(query_2a, conn)

         ssn    nomedep parentesco
0  123456789     Michel      FILHO
1  123456789      Alice      FILHA
2  123456789  Elizabete    CONJUGE
3  333445555    Teodoro      FILHO
4  333445555      Alice      FILHA
5  333445555      Joana    CONJUGE
6  453453453       Joao    CONJUGE
7  987654321     Abdala    CONJUGE

### Query 2b
- **SELECT e.pnome AS "Nome do Empregado", e.endereco AS "Endereço do Empregado"**: Seleciona o nome e o endereço dos empregados.
- **FROM EMPREGADO e JOIN DEPARTAMENTO d ON e.dno = d.dnumero**: Realiza um `JOIN` entre as tabelas `EMPREGADO` e `DEPARTAMENTO` baseado no número do departamento.
- **WHERE d.dnumero = '5'**: Filtra os empregados que pertencem ao departamento número 5.

In [3]:
query_2b = """
SELECT e.pnome AS "Nome do Empregado", e.endereco AS "Endereço do Empregado" FROM EMPREGADO e JOIN DEPARTAMENTO d ON e.dno = d.dnumero WHERE d.dnumero = '5';
"""
df_2b = pd.read_sql(query_2b, conn)
df_2b

C:\Users\Ruy\AppData\Local\Temp\ipykernel_4520\2229755156.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_2b = pd.read_sql(query_2b, conn)

  Nome do Empregado                        Endereço do Empregado
0              Joao          R. 24 de maio, 1500 - Curitiba - PR
1             Fabio              R. Alagoas, 325 - Curitiba - PR
2           Ricardo  Av. Figueira, 55 - Almirante Tamandare - PR
3           Jussara            Trav. da Lapa, 23 - Curitiba - PR

### Query 2c
- **SELECT ...**: Seleciona vários atributos incluindo o nome do projeto, nome do departamento, último nome, endereço e data de nascimento do gerente.
- **FROM PROJETO p JOIN DEPARTAMENTO d ON p.dnum = d.dnumero JOIN EMPREGADO e ON d.gerssn = e.ssn**: Conecta as tabelas `PROJETO`, `DEPARTAMENTO`, e `EMPREGADO` para reunir informações sobre projetos e seus gerentes.
- **WHERE p.plocal= 'Araucaria'**: Filtra os projetos que estão localizados em 'Araucária'.

In [4]:
query_2c = """
SELECT p.pjnome AS "Nome do Projeto", d.dnome AS "Nome do Departamento", e.unome AS "Último Nome do Gerente", e.endereco AS "Endereço do Gerente", e.datanasc AS "Data de Nascimento do Gerente" FROM PROJETO p JOIN DEPARTAMENTO d ON p.dnum = d.dnumero JOIN EMPREGADO e ON d.gerssn = e.ssn WHERE p.plocal= 'Araucaria';
"""
df_2c = pd.read_sql(query_2c, conn)
df_2c

C:\Users\Ruy\AppData\Local\Temp\ipykernel_4520\3757195830.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_2c = pd.read_sql(query_2c, conn)

,Nome do Projeto,Nome do Departamento,Último Nome do Gerente,Endereço do Gerente,Data de Nascimento do Gerente
0,ProdutoY,Pesquisa,Souza,"R. 24 de maio, 1500 - Curitiba - PR",1965-01-09

### Query 2d
- **SELECT e.pnome, t.horas**: Seleciona o nome do empregado e as horas trabalhadas.
- **FROM TRABALHA t JOIN EMPREGADO e ON t.essn = e.ssn JOIN PROJETO p ON t.pno = p.pnumero**: Realiza um `JOIN` entre as tabelas `TRABALHA`, `EMPREGADO` e `PROJETO`.
- **WHERE t.horas > '10' AND p.pjnome = 'Automatizacao'**: Filtra os registros para incluir apenas aqueles em que as horas trabalhadas são maiores que 10 e o nome do projeto é 'Automatização'.

In [5]:
query_2d = """
SELECT e.pnome, t.horas FROM TRABALHA t JOIN EMPREGADO e ON t.essn = e.ssn JOIN PROJETO p ON t.pno = p.pnumero WHERE t.horas > '10' AND p.pjnome = 'Automatizacao';
"""
df_2d = pd.read_sql(query_2d, conn)
df_2d

C:\Users\Ruy\AppData\Local\Temp\ipykernel_4520\1202953585.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_2d = pd.read_sql(query_2d, conn)

     pnome  horas
0  Alberto   35.0

### Query 2e
- **SELECT pnome AS "Nome do Empregado"**: Seleciona os nomes dos empregados.
- **FROM EMPREGADO**: Especifica a tabela de onde os dados são retirados.
- **ORDER BY salario DESC LIMIT 3**: Ordena os empregados pelo salário de forma decrescente e limita os resultados aos três com maiores salários.

In [6]:
query_2e = """
SELECT pnome AS "Nome do Empregado" FROM EMPREGADO ORDER BY salario DESC LIMIT 3;
"""
df_2e = pd.read_sql(query_2e, conn)
df_2e

C:\Users\Ruy\AppData\Local\Temp\ipykernel_4520\2734383597.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_2e = pd.read_sql(query_2e, conn)

  Nome do Empregado
0           Roberto
1           Roberto
2           Joaquim

### Query 2f
- **SELECT pnome AS "Nome do Supervisor", (salario * 1.20) AS "Salário com Aumento"**: Seleciona o nome do supervisor e calcula um aumento de 20% no salário.
- **FROM EMPREGADO**: Indica que a consulta é feita na tabela `EMPREGADO`.
- **WHERE ssn IN (SELECT superssn FROM EMPREGADO WHERE superssn IS NOT NULL)**: Filtra para incluir apenas os empregados que são supervisores.

In [7]:
query_2f = """
SELECT pnome AS "Nome do Supervisor", (salario * 1.20) AS "Salário com Aumento" FROM EMPREGADO WHERE ssn IN (SELECT superssn FROM EMPREGADO WHERE superssn IS NOT NULL);
"""
df_2f = pd.read_sql(query_2f, conn)
df_2f

C:\Users\Ruy\AppData\Local\Temp\ipykernel_4520\2270458952.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_2f = pd.read_sql(query_2f, conn)

  Nome do Supervisor  Salário com Aumento
0              Fabio              48000.0
1           Jennifer              51600.0
2            Joaquim              66000.0
3            Roberto              69600.0

### Query 2g
- **SELECT d.dnome AS "Nome do Departamento", l.dlocalizacao AS "Localidade"**: Seleciona o nome do departamento e sua localização.
- **FROM DEPARTAMENTO d JOIN LOCALIZACAO l ON d.dnumero = l.dnum**: Realiza um `JOIN` entre as tabelas `DEPARTAMENTO` e `LOCALIZACAO` para associar cada departamento à sua localização física.

In [8]:
query_2g = """
SELECT d.dnome AS "Nome do Departamento", l.dlocalizacao AS "Localidade" FROM DEPARTAMENTO d JOIN LOCALIZACAO l ON d.dnumero = l.dnum;
"""
df_2g = pd.read_sql(query_2g, conn)
df_2g

C:\Users\Ruy\AppData\Local\Temp\ipykernel_4520\1935961321.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_2g = pd.read_sql(query_2g, conn)

  Nome do Departamento Localidade
0  Sede Administrativa   Curitiba
1        Administracao    Colombo
2             Pesquisa  Araucaria
3             Pesquisa   Curitiba
4             Pesquisa    Pinhais

### Query 2h
- **SELECT d.dnome AS "Nome do Departamento", p.pjnome AS "Nome do Projeto"**: Seleciona o nome do departamento e o nome do projeto associado.
- **FROM DEPARTAMENTO d JOIN PROJETO p ON d.dnumero = p.dnum**: Conecta a tabela `DEPARTAMENTO` com a tabela `PROJETO`, usando o número do departamento para encontrar todos os projetos relacionados a cada departamento.

In [9]:
query_2h = """
SELECT d.dnome AS "Nome do Departamento", p.pjnome AS "Nome do Projeto" FROM DEPARTAMENTO d JOIN PROJETO p ON d.dnumero = p.dnum;
"""
df_2h = pd.read_sql(query_2h, conn)
df_2h

C:\Users\Ruy\AppData\Local\Temp\ipykernel_4520\1929250889.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_2h = pd.read_sql(query_2h, conn)

  Nome do Departamento   Nome do Projeto
0             Pesquisa          ProdutoX
1             Pesquisa          ProdutoY
2             Pesquisa          ProdutoZ
3        Administracao     Automatizacao
4  Sede Administrativa     Reorganizacao
5        Administracao  Novos Beneficios

### Query 2i
- **SELECT pnome AS "Nome do Empregado", datanasc AS "Data de Nascimento"**: Seleciona o nome e a data de nascimento dos empregados.
- **FROM EMPREGADO**: Especifica a tabela `EMPREGADO` de onde os dados serão retirados.
- **WHERE sexo = 'F' AND salario > 30000**: Filtra para incluir apenas empregadas do sexo feminino com salário superior a 30.000.

In [10]:
query_2i = """
SELECT pnome AS "Nome do Empregado", datanasc AS "Data de Nascimento" FROM EMPREGADO WHERE sexo = 'F' AND salario > 30000;
"""
df_2i = pd.read_sql(query_2i, conn)
df_2i

C:\Users\Ruy\AppData\Local\Temp\ipykernel_4520\2470596438.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_2i = pd.read_sql(query_2i, conn)

  Nome do Empregado Data de Nascimento
0          Jennifer         1941-06-20

### Query 2j
- **SELECT p.pjnome AS "Nome do Projeto"**: Seleciona o nome do projeto.
- **FROM EMPREGADO e JOIN TRABALHA t ON e.ssn = t.essn JOIN PROJETO p ON t.pno = p.pnumero**: Realiza um `JOIN` entre as tabelas `EMPREGADO`, `TRABALHA` e `PROJETO`, conectando um empregado a seu trabalho e ao projeto correspondente.
- **WHERE e.pnome = 'Fabio'**: Filtra para incluir apenas os projetos nos quais um empregado chamado Fabio trabalha.

In [11]:
query_2j = """
SELECT p.pjnome AS "Nome do Projeto" FROM EMPREGADO e JOIN TRABALHA t ON e.ssn = t.essn JOIN PROJETO p ON t.pno = p.pnumero WHERE e.pnome = 'Fabio';
"""
df_2j = pd.read_sql(query_2j, conn)
df_2j

C:\Users\Ruy\AppData\Local\Temp\ipykernel_4520\2668046750.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_2j = pd.read_sql(query_2j, conn)

Empty DataFrame
Columns: [Nome do Projeto]
Index: []

In [12]:
# Fechar cursor e conexão
cur.close()
conn.close()